In [19]:
## packages, libraries, framework 

import pandas as pd


data = {
    "names": ["sam", "jam", "ram"],
    "numbers": [3,5,2],
    "fax": [1231231,3253453,3453456],
}

dataframe = pd.DataFrame(data)

print(dataframe)
print(type(dataframe))

  names  numbers      fax
0   sam        3  1231231
1   jam        5  3253453
2   ram        2  3453456
<class 'pandas.DataFrame'>

In [20]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      str
 1   numbers  3 non-null      int64
 2   fax      3 non-null      int64
dtypes: int64(2), str(1)
memory usage: 204.0 bytes

In [21]:
dataframe.describe()

        numbers           fax
count  3.000000  3.000000e+00
mean   3.333333  2.646047e+06
std    1.527525  1.229340e+06
min    2.000000  1.231231e+06
25%    2.500000  2.242342e+06
50%    3.000000  3.253453e+06
75%    4.000000  3.353454e+06
max    5.000000  3.453456e+06

In [22]:
dataframe.columns

Index(['names', 'numbers', 'fax'], dtype='str')

In [31]:
#dataframe.corr('numbers', 'fax')
num = dataframe['numbers']
fa = dataframe['fax']

In [32]:
num

0    3
1    5
2    2
Name: numbers, dtype: int64

In [33]:
fa

0    1231231
1    3253453
2    3453456
Name: fax, dtype: int64

In [37]:
correlation = num.corr(fa)

In [38]:
print(correlation)

0.10847609288637718

In [45]:
data = {
    "time": [44,33,22,55,66,77],
    "running": [3,4,5,7,8,7],
    "calories": [544,433,222,777,888,999],
    "address": ['123 some address', "someer", "sfdsfsf", "asdasdsdads", "werwwe f ", "3434 sdfs df s"]
}

In [46]:
df = pd.DataFrame(data)

In [58]:
df

   time  running  calories           address
0    44        3       544  123 some address
1    33        4       433            someer
2    22        5       222           sfdsfsf
3    55        7       777       asdasdsdads
4    66        8       888         werwwe f
5    77        7       999    3434 sdfs df s

In [59]:
df.corr(numeric_only=True)

              time   running  calories
time      1.000000  0.706758  0.992655
running   0.706758  1.000000  0.730202
calories  0.992655  0.730202  1.000000

In [52]:
var = df['time'].corr(df['running'])

In [53]:
var

np.float64(0.706758366885431)

In [54]:
data_corr = df[['time','running','calories']]

In [55]:
data_corr

   time  running  calories
0    44        3       544
1    33        4       433
2    22        5       222
3    55        7       777
4    66        8       888
5    77        7       999

In [56]:
data_corr.corr()

              time   running  calories
time      1.000000  0.706758  0.992655
running   0.706758  1.000000  0.730202
calories  0.992655  0.730202  1.000000